# ViewCameraPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewCameraPosition Property
ParameterTypeId Class See Also
---
"Camera Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewCameraPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewCameraPosition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewCameraPosition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace